# House Market

Let's go a little further into python.

1. Download the four files “superficie.csv” / “nombre_de_sdb.csv” / “nombre_de_chambres.csv” / "house_price.csv"

2. Read the files and create the 4 corresponding Dataframes

In [19]:
import pandas as pd

data1 = pd.read_csv('house_price.csv')

data1.head()

   Unnamed: 0  id  house_price
0           0  14    1918154.0
1           1  30     739142.0
2           2  70    1621938.0
3           3  77    1319862.0
4           4  50     146250.0

In [20]:
data2 = pd.read_csv("nombre_de_chambres.csv")

data2.head()

   0  1
0  1  4
1  2  1
2  3  4
3  4  2
4  5  4

In [21]:
data3 = pd.read_csv("nombre_de_sdb.csv")

data3.head()

   0  2
0  1  1
1  2  1
2  3  3
3  4  1
4  5  3

In [22]:
data4 = pd.read_csv("superficie.csv")

data4.head()

   0  28844
0  1  27667
1  2  14742
2  3  28089
3  4  11713
4  5  28591

3. Give a column name to the three datasets that don't have a header in the source file

In [42]:
data1.head()

   Unnamed: 0  id  house_price
0           0  14    1918154.0
1           1  30     739142.0
2           2  70    1621938.0
3           3  77    1319862.0
4           4  50     146250.0

In [32]:
data2.rename(columns={'1':'Rooms'} , inplace=True)

data2.rename(columns={'0':'id'} , inplace=True)

data2.head()

   id  Rooms
0   1      4
1   2      1
2   3      4
3   4      2
4   5      4

In [33]:
data3.rename(columns={'2': 'Bathrooms'}, inplace = True )

data3.rename(columns={'0': 'id'}, inplace = True )

data3.head()

   id  Bathrooms
0   1          1
1   2          1
2   3          3
3   4          1
4   5          3

In [36]:
data4.rename(columns= {'28844' : 'Surface'} , inplace=True)

data4.rename(columns= {'0' : 'id'} , inplace=True)

data4.head()

   id  Surface
0   1    27667
1   2    14742
2   3    28089
3   4    11713
4   5    28591

4. Make an inner join of these four datasets into a single dataframe.

In [45]:
from functools import reduce
import pandas as pd

dfs = [data1, data2, data3, data4]

dataset = reduce(lambda left, right: pd.merge(left, right, on='id', how='inner'), dfs)

dataset.head()

   Unnamed: 0  id  house_price  Rooms  Bathrooms  Surface
0           0  14    1918154.0      4          1    26824
1           1  30     739142.0      4          2    23872
2           2  70    1621938.0      2          2    26539
3           3  77    1319862.0      2          1    29449
4           4  50     146250.0      2          3    10502

5. What is the average surface area of the houses in our dataset?

In [ ]:
dataset['Surface'].mean()

np.float64(20354.878787878788)

6. What is the median and average number of rooms?

7. What is the average cost of a house?

8. What is the average cost of a house, depending on the number of rooms it has?

10. The average cost per room doesn't tell us much. Let's try to categorize by size.

  - Create a new column in your dataset that we'll call home_size
Create five categories that respectively correspond to:
      - "very large" $=$ "a house larger than 25,000 sqrt_feet"
      - "large" $=$ "a house between 20,000 and 25,000 sqrt_feet"
      - "medium" $=$ "a house between 15,000 and 20,000 sqrt_feet"
      - "small" $=$ "a house between 10,000 and 15,000 sqrt_feet"
      - "very small" $=$ a house less than 10,000 sqrt_feet"

Fill in the corresponding rows in the house_size column.

11. What is the average cost of a house depending on its size category?

 12. Apply the code below to view your result. What can you conclude?

In [24]:
import plotly.express as px
fig = px.scatter(dataset, x = "surface", y = "house_price", trendline = "ols")
fig.show()

NameError: name 'dataset' is not defined